<?php 
	// PHP অথবা যেকোনো Programming Language এ else if/elseif statement হচ্ছে, একাধিক বা অনেকগুলো condition বা শর্তের মধ্যে ক্রমান্বয়ে সবগুলো condition বা শর্ত চেক করতে থাকে এবং প্রথম যেই শর্ত পূরণ হবে , তার প্রোগ্রাম execute করার সুযোগ দেয়। এবং পরবর্তী condition গুলো আর চেক করেনা। আরেকটু সহজ ভাবে বলি, ধরুন আপনি দোকানে যাবেন আপেল,কমলা,আঙ্গুর অথবা কলা কেনার জন্য, এক্ষেত্রে আপনার প্রথম পছন্দ আপেল, আর যদি আপেল না পাওয়া যায় তাহলে কমলা নিয়ে আসবেন , কমলা না পাওয়া গেলে আঙ্গুর নিয়ে আসবেন, আর যদি আঙ্গুর ও না পাওয়া যায় তাহলে কলা নিয়ে আসবেন। বাস্তব জীবনের এই চিত্র টি ই PHP অথবা যেকোনো Programming Language এ else if/elseif statement দিয়ে সমাধান করা হয়।

$a=10;
	if($a=10){
		echo $a."<br>";
	}


$case = "A";

switch($case){
	case "A":
	echo "echo A";
	break;

	case "B":
	echo "echo B";
	break;

	default;
 }

 ?>
